--[[
Lua 是动态类型语言：变量没有类型，只有值有类型

Lua 的所有值都是第一类值：
  - 所有值都可以存储在变量中
  - 所有值都可以作为参数传递给其他函数
  - 所有值都可以作为结果返回

Lua 有 8 中基本类型：
  - nil
  - boolean
  - number
  - string
  - function
  - userdata
  - thread
  - table
--]]

--[[
nil: 表示有用值的缺失，在表中表示一个缺失的键
--]]
do
  local a
  print(a) -- nil
  local t = {}
  print(t["name"]) -- nil
end

--[[
number：64位整数(integer)和双精度64位实数(float)
整数值，溢出根据二进制补码规则环绕
整数和实数：会进行自动转换
--]]

--[[
string：不可变字节序列

--]]

do
  local s
  -- 字符串可以包含任何 8 位值（字符串中的每个字节都被原样保存），包括嵌入的零'\0'
  s = "\0"
  print(#s) -- 1

  -- Lua 也与编码无关；它不假定字符串的内容，按照字节而非字符理解字符串
  s = "你好"
  print(#s) -- 6 字节数
  -- 任何字符串的长度必须适合 Lua 整数，并且字符串加上一个小标头必须适合 size_t（字符串不能大到超过系统可表示的内存大小）
  -- #s <= max integer
  -- s size <= size_t
end

--[[
userdata: 允许任意 C 数据存储在 Lua 变量中。

userdata 值表示一块原始内存。
有两种 userdata：完整 userdata，它是一个由 Lua 管理内存块的对象，以及轻量 userdata，它只是一个 C 指针值。
userdata 在 Lua 中没有预定义的操作，除了赋值和身份测试。
通过使用元表，程序员可以为完整 userdata 值定义操作（参见 §2.4）。
userdata 值不能在 Lua 中创建或修改，只能通过 C API。
这保证了宿主程序和 C 库所拥有数据的完整性。
--]]

--[[
thread：用于实现协程

Lua 在所有系统上都支持协程，即使那些不原生支持线程的系统
--]]

--[[
table：

索引是除了 nil 和 NaN 之外的任何 Lua 值
索引遵循原始相等性：
  表达式 a[i] 和 a[j] 指的是同一个表元素，当且仅当 i 和 j 原始相等（即，没有元方法时相等）
  具有整数值的浮点数与其各自的整数相等(1.0 == 1)
  任何用作键且等于整数的浮点数都将被转化该整数

表字段的值可以是任何类型

任何不属于表的键都具有关联值 nil

a.name 为 a['name']的语法糖 

变量只包含其引用，不涉及任何形式的复制
--]]
